# CreatingCloudSharedLocal Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CreateRelatedFileProgressChangedEventArgs..::..CreatingCloudSharedLocal Property
CreateRelatedFileProgressChangedEventArgs Class See Also
---
Indicates if it is creating cloud shared local model.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool CreatingCloudSharedLocal { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CreatingCloudSharedLocal As Boolean
	Get
```

Visual C++
---
```text
public:
property bool CreatingCloudSharedLocal {
	bool get ();
}
```

# See Also
CreateRelatedFileProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace